cf/Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПриходныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.Сборка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТМЦ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупочноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/AccumulationRegisters/ПартииТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Catalogs/Партии/Ext/ManagerModule.bsl
//Возвращает Партию указанного документа и товара
Функция НайтиПартию(Номенклатура, Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партии.Ссылка
	|ИЗ
	|	Справочник.Партии КАК Партии
	|ГДЕ
	|	Партии.ПометкаУдаления = ЛОЖЬ
	|	И Партии.Владелец = &Владелец
	|	И Партии.ПриходныйДокумент = &ПриходныйДокумент";		
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("ПриходныйДокумент", Документ);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//Возвращает ТЗ Партий по отбору. Если Партия не выбрана то представляет ТЗ всех партий с остатками
Функция ПолучитьСписокОстатковПартий(Номенклатура,Дата,Склад,Организация,Партия) Экспорт 
	
	Дата = ОснПроцедурыИФ.ПолучитьСтруктуруКонтоляОстатков(Организация,Дата).ДатаОстатков;
	
	Если ЗначениеЗаполнено(Партия) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.Партия КАК Партия,
		|	ПартииТоваровОстатки.СуммаОстаток,
		|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Номенклатура = &Номенклатура
		|				И Склад = &Склад
		|				И Партия = &Партия) КАК ПартииТоваровОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОстаток
		|АВТОУПОРЯДОЧИВАНИЕ";	
		Запрос.УстановитьПараметр("Партия", Партия);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.Партия КАК Партия,
		|	ПартииТоваровОстатки.СуммаОстаток,
		|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ПартииТоваровОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоОстаток
		|АВТОУПОРЯДОЧИВАНИЕ"; 		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата+1);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

//Возвращает структуру Остаток и ДатуОстатка
Функция ПолучитьОстатокНаДату(Номенклатура,Организация,Склад,Ключ,ДатаОстатка) Экспорт
	
	С = Новый Структура;
	
	Если Организация <> Неопределено Тогда
		СтруктураКонтроляОстатков 	= ОснПроцедурыИФ.ПолучитьСтруктуруКонтоляОстатков(Организация,ДатаОстатка);
		ДатаОстатка 				= СтруктураКонтроляОстатков.ДатаОстатков;
		ВидКонтроляОстатков 		= СтруктураКонтроляОстатков.ВидКонтроляОстатков; 
	Иначе
		ВидКонтроляОстатков 		= Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если Организация <> Неопределено и Склад <> Неопределено Тогда //Если выбрана Организация и Склад
		Запрос.Текст =                                             //тогда остатки на дату контроля остатков и на конец всего периода
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.КоличествоОстаток,
		|	ПартииТоваровОстаткиНаКонецВсегоПериода.КоличествоОстаток КАК ОстатокНаКонецВсегоПериода
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&ПериодОстатка,
		|			Организация = &Организация
		|				И Склад = &Склад
		|				И Номенклатура = &Номенклатура
		|				И Партия = &Партия) КАК ПартииТоваровОстатки,
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&ДатаОстаткаНаКонецВсегоПериода,
		|			Организация = &Организация
		|				И Склад = &Склад
		|				И Партия = &Партия
		|				И Номенклатура = &Номенклатура) КАК ПартииТоваровОстаткиНаКонецВсегоПериода";		
	Иначе //Если Организация или Склад не выбраны то остатки не фильтруются по организации и складу		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.КоличествоОстаток,
		|	ПартииТоваровОстаткиНаКонецВсегоПериода.КоличествоОстаток КАК ОстатокНаКонецВсегоПериода
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&ПериодОстатка,
		|				Номенклатура = &Номенклатура
		|				И Партия = &Партия) КАК ПартииТоваровОстатки,
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&ДатаОстаткаНаКонецВсегоПериода,
		|				Партия = &Партия
		|				И Номенклатура = &Номенклатура) КАК ПартииТоваровОстаткиНаКонецВсегоПериода"; 		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Партия", Ключ);
	Запрос.УстановитьПараметр("ПериодОстатка", ДатаОстатка);
	Запрос.УстановитьПараметр("ДатаОстаткаНаКонецВсегоПериода", КонецМесяца(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 1 Тогда
		Сообщить("Обнаружено " +РезультатЗапроса.Количество()+ " строк остатков!");
	КонецЕсли;
	
	С.Вставить("Остаток",РезультатЗапроса[0].КоличествоОстаток);
	С.Вставить("ДатаОстатка",ДатаОстатка);
	С.Вставить("ВидКонтроляОстатков",ВидКонтроляОстатков);
	С.Вставить("ОстатокНаКонецВсегоПериода",РезультатЗапроса[0].ОстатокНаКонецВсегоПериода);
	
	Возврат С;
	
КонецФункции

//Пометка на удаление всех партий этого приходного документа
Процедура УдалениеИлиОтменаУделенияПартийДокумента(Ссылка,ПометкаУдаления) Экспорт	
	
	Если ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Партии.Ссылка
		|ИЗ
		|	Справочник.Партии КАК Партии
		|ГДЕ
		|	Партии.ПометкаУдаления = ЛОЖЬ
		|	И Партии.ПриходныйДокумент = &ПриходныйДокумент";	
		Запрос.УстановитьПараметр("ПриходныйДокумент", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			П = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			П.УстановитьПометкуУдаления(Истина);
		КонецЦикла;
	Иначе
		Для Каждого Стр из Ссылка.Товары Цикл
			Если Стр.Партия.ПометкаУдаления Тогда
				П = Стр.Партия.ПолучитьОбъект();
				П.УстановитьПометкуУдаления(Ложь);	
			КонецЕсли; 			
		КонецЦикла;		
	КонецЕсли;      
	
КонецПроцедуры

//Выбрать все ЭлементыСпрПартии по этому док и те которых нет в ТаблицеТоваров пометить на удаление и очистить данные акромя ПрихДок
Процедура УдалитьПартииНеучаствующиеВДокументе(Ссылка)	
	   
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партии.Ссылка
	|ИЗ
	|	Справочник.Партии КАК Партии
	|ГДЕ
	|	Партии.ПометкаУдаления = ЛОЖЬ
	|	И Партии.ПриходныйДокумент = &ПриходныйДокумент";	
	Запрос.УстановитьПараметр("ПриходныйДокумент", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Найдена = Ложь;
		Для Каждого Стр из Ссылка.Товары Цикл
			
			Если Стр.Партия = ВыборкаДетальныеЗаписи.Ссылка Тогда
				Найдена = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Найдена Тогда
			П = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			П.УстановитьПометкуУдаления(Истина);
		КонецЕсли;   		
	КонецЦикла;  
КонецПроцедуры

//Создание новой Партии при изменении Номенклатуры в документентах поступлений
Функция СоздатьНовуюПартию(Номенклатура) Экспорт 
	
	НоваяПартия = СоздатьЭлемент();
	НоваяПартия.Владелец = Номенклатура;
	НоваяПартия.Записать();
	
	Возврат НоваяПартия;
	
КонецФункции 

//Дополняет ранее созданную Партию данными из документа при проведении
Процедура ОбновитьПартию(Ссылка,Отказ) Экспорт 
	
	УдалитьПартииНеучаствующиеВДокументе(Ссылка);
	
	Для Каждого ТекСтрокаТовары Из Ссылка.Товары Цикл
		   		
		СуммаСебестоимость 		= ТекСтрокаТовары.Сумма;
		КоличествоСебестоимость = ТекСтрокаТовары.Количество;
		
		Если ТекСтрокаТовары.Партия.ЗакупочнаяСумма <> СуммаСебестоимость 
			или ТекСтрокаТовары.Партия.ЗакупочноеКоличество <> КоличествоСебестоимость 
			или ТекСтрокаТовары.Партия.ПриходныйДокумент <> Ссылка Тогда
			
			ПартияСсылка = ТекСтрокаТовары.Партия.ПолучитьОбъект();
			ПартияСсылка.ЗакупочнаяЦена 		= СуммаСебестоимость/КоличествоСебестоимость;
			ПартияСсылка.ЗакупочнаяСумма		= СуммаСебестоимость;
			ПартияСсылка.ЗакупочноеКоличество 	= КоличествоСебестоимость;
			ПартияСсылка.ПриходныйДокумент 		= Ссылка;		
			
			Попытка
				ПартияСсылка.Записать();			
			Исключение
				Сообщить("Не изменена партия по отбору: " +ТекСтрокаТовары.Номенклатура+ " , " +Ссылка+ " "+ ОписаниеОшибки());
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
		
		Если ТекСтрокаТовары.Партия.ПометкаУдаления Тогда
			ТекСтрокаТовары.Партия.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		
	КонецЦикла; 	
КонецПроцедуры
